//Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел 
//строго больше 0 ввёл пользователь. 0, 7, 8, -2, -2 -> 2,  0, 1, -7, 567, 89, 223-> 4
/*Console.WriteLine("Введите M чисел через пробел: ");
string X = Console.ReadLine()!;;
string[] num = X.Split(' ', StringSplitOptions.RemoveEmptyEntries);
int count = 0;
foreach (string numX in num)
if(Convert.ToInt32(Convert.ToString(numX)) > 0) count = count + 1;
else count = count * 1;
Console.WriteLine($"Пользователь ввел: {count} больше 0");*/ 
  

